Configuration/Диплом/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Configuration/Диплом/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/Диплом/src/CommonModules/ВКМ_ФоновыеЗадания/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПроверкаАктовДлитльнаяОперация(Период, УникальныйИдентификатор) экспорт   
//Функция ПроверкаАктовДлитльнаяОперация(Параметр, Период) экспорт

	
	Период.ДатаНачала = НачалоМесяца(Период.ДатаНачала);
	Период.ДатаОкончания = КонецМесяца(Период.ДатаОкончания); 
	
	Если Месяц(Период.ДатаНачала) <> Месяц(Период.ДатаОкончания) Тогда
		 Период.ДатаОкончания = КонецМесяца(Период.ДатаНачала);
		 НовоеСообщение = Новый СообщениеПользователю;
		 НовоеСообщение.Поле = "Период"; 
		 НовоеСообщение.Текст = "В поле периода нужно выбирать период - МЕЯЦ";
		 НовоеСообщение.Сообщить();
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	             |	ДоговорыКонтрагентов.Организация КАК Организация,
	             |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	             |	ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораНачало КАК ВКМ_ПериодДействияДоговораНачало,
	             |	ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораОкончание КАК ВКМ_ПериодДействияДоговораОкончание
	             |ПОМЕСТИТЬ ВТ_СправочникДоговоры
	             |ИЗ
	             |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	             |ГДЕ
	             |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	             |	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораНачало, МЕСЯЦ) <= &ДатаНачало
	             |	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораОкончание, МЕСЯЦ) >= &ДатаКонец
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	РеализацияТоваровУслуг.Ссылка КАК Документ,
	             |	РеализацияТоваровУслуг.Организация КАК Организация,
	             |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	             |	РеализацияТоваровУслуг.Договор КАК Договор,
	             |	РеализацияТоваровУслуг.Дата КАК Дата
	             |ПОМЕСТИТЬ ВТ_ДанныеДокументов
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	             |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаКонец
	             |	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_СправочникДоговоры.Договор КАК Договор,
	             |	ВТ_СправочникДоговоры.Организация КАК Организация,
	             |	ВТ_СправочникДоговоры.Контрагент КАК Контрагент,
	             |	ВТ_ДанныеДокументов.Документ КАК ДокументСсылка
	             |ИЗ
	             |	ВТ_СправочникДоговоры КАК ВТ_СправочникДоговоры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
	             |		ПО ВТ_СправочникДоговоры.Организация = ВТ_ДанныеДокументов.Организация
	             |			И ВТ_СправочникДоговоры.Контрагент = ВТ_ДанныеДокументов.Контрагент
	             |			И ВТ_СправочникДоговоры.Договор = ВТ_ДанныеДокументов.Договор";
  
	Запрос.УстановитьПараметр("ДатаНачало",Период.ДатаНачала); 
	Запрос.УстановитьПараметр("ДатаКонец",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание);
	Выборка = Запрос.Выполнить().Выбрать();
	ВыборкаТЗ =  Запрос.Выполнить().Выгрузить();
	
	
	//СписокАктов.Загрузить(ВыборкаТЗ); 
	
	//{Заглушка для имитации длительной операции
	Пауза = ТекущаяДатаСеанса()+ 5;//задержка на 5 сек
	пока ТекущаяДатаСеанса()<= Пауза цикл
	КонецЦикла;
	//}
	
	//Возврат Параметр;//просто будем сообщать
	АдресВХ = ПоместитьВоВременноеХранилище(ВыборкаТЗ,УникальныйИдентификатор); 
	//ТЗ_ = ПолучитьИзВременногоХранилища(АдресВХ);
	Возврат АдресВХ;
КонецФункции  

#КонецОбласти
